export const arabicToHieroglyphics: { [key: string]: string } = {
  ا: '𓄿',
  إ: '𓇋',
  ي: '𓇌',
  و: '𓅱',
  ب: '𓃀',
  پ: '𓊪',
  ع: '𓂝',
  ت: '𓏏',
  ط: '𓏏', // close alternative
  ث: '𓍿',
  م: '𓅓',
  ف: '𓆑',
  ن: '𓈖',
  ر: '𓂋',
  ه: '𓉔',
  ح: '𓎛',
  س: '𓋴',
  ص: '𓋴', // close alternative
  ش: '𓈙',
  ل: '𓃭',
  خ: '𓐍',
  غ: '𓄡',
  ز: '𓊃',
  ق: '𓈎',
  ك: '𓎡',
  چ: '𓎼',
  د: '𓂧',
  ض: '𓂧', // close alternative
  ظ: '𓂧', // close alternative
  ج: '𓆓',
  // TODO: for Amro, add the following mappings
  نفر: '𓄤',
  عب: '𓃁',
  مت: '𓄾',
  اا: '𓅀',
  مع: '𓅖',
};
